import { Component, OnInit } from '@angular/core';

@Component({
    selector: 'mpat-about',
    templateUrl: './about.component.html',
    styleUrls: ['./about.component.scss']
})
export class AboutComponent implements OnInit {
    public purpose = [
        "เป็นองค์กรผู้แทนของผู้ประกอบวิชาชีพเภสัชกรรมการตลาด",
        "พัฒนามาตรฐานวิชาชีพเภสัชกรการตลาด เพื่อประโยชน์แก่สมาชิกและสังคม",
        "ส่งเสริมและสนับสนุนการศึกษา การวิจัย และเผยแพร่ผลงานทางวิชาการที่เกี่ยวข้องกับด้านเภสัชกรรมการตลาด",
        "สนับสนุนให้สมาชิกเผยแพร่ความรู้ทางด้านยาต่อบุคคลากรทางการแพทย์ และประชาชน เพื่อให้มีการใช้ยาอย่างเหมาะสม ปลอดภัย มีประสิทธิภาพ และประสิทธิผล",
        "ส่งเสริมสนับสนุนและประสานงานด้านวิชาการและวิชาชีพแก่สมาชิก",
        "ร่วมมือกับ สภาเภสัชกรรม  องค์กรเครือข่ายวิชาชีพเภสัชกรรม  รวมถึงองค์กรที่เกี่ยวข้องทั้งในและต่างประเทศ เพื่อพัฒนาวิชาชีพ เภสัชกรรมการตลาด",
        "ให้ข้อเสนอแนะหรือคำปรึกษาที่เกี่ยวกับเภสัชกรรมการตลาด ต่อ องค์กร หน่วยงาน ประชาชน เพื่อประโยชน์ ต่อ  สมาชิก และสังคมโดยรวม",
        "ส่งเสริมและพิทักษ์จรรยาบรรณแห่งวิชาชีพเภสัชกรรมการตลาด เพื่อผดุงไว้ซึ่งเกียรติ และศักดิ์ศรีของสมาชิก",
    ];
    public mission = [
        "เป็นศูนย์รวมของเภสัชกรการตลาด",
        "มุ่งมั่น พัฒนา และส่งเสริมวิชาชีพเภสัชกรรมการตลาด",
        "มุ่งมั่นพิทักษ์จรรยาบรรณวิชาชีพ เพื่อสร้างการยอมรับจากเภสัชกรการตลาด บุคลากรทางด้านสาธารณสุขและสังคม",
    ]
    public committee = [
        { name: "นาย สุวิทย์ ธีรกุลชน", type: "นายกสมาคมฯ" },
        { name: "นาย สุเชาน์ คำนูณทรัพย์", type: "อุปนายก 1" },
        { name: "นาย ปรีชา พันธุ์ติเวช", type: "อุปนายก 2" },
        { name: "นาย ปยุต ถาวรสถิตย์", type: "เลขาธิการ" },
        { name: "นาง สุภาภรณ์ อัจฉริยวนิช", type: "เหรัญญิก/กรรมการกลาง" },
        { name: "นาย ผดุงยศ พิสุทธาดามงคล", type: "ผู้ช่วยเหรัญญิก" },
        { name: "นาย อภิชาติ ปฎิโภคสุทธิ์", type: "ปฎิคม" },
        { name: "นาย พิชญภณ หนุนภักดี", type: "นายทะเบียน" },
        { name: "นาย วิรุณ เวชศิริ", type: "ประชาสัมพันธ์" },
        { name: "นาย สุทธิพงศ์ หนูฤทธิ์", type: "ประชาสัมพันธ์" },
        { name: "คุณ รัตนพร ทางธนกุล", type: "วิชาการ 1" },
        { name: "นาย ประพฤทธิ์ สวัสดิภาชัย", type: "วิชาการ 2" },
        { name: "คุณ รัชนีวรรณ อินทรหนองไผ่", type: "วิชาการ 3" },
        { name: "นาย กร ศรเลิศล้ำวาณิช", type: "วิชาชีพ 1" },
        { name: "นาย อุดม จันทร์เจริญ", type: " " },
        { name: "นาย นันทวัฒน์ ศิโรโรจน์", type: "กรรมการกลาง" },
        { name: "นาย จิรศาสตร์ ไชยเลิศ", type: "กรรมการกลาง" }
    ];

    constructor() { }
    ngOnInit() { }
}